In [12]:
import numpy as np
import pandas as pd
excel_obj = pd.ExcelFile('isp_dirty_data.xlsx')

df = excel_obj.parse('Sheet1', dtype={'MSISDN': str})
display(df)
print('ตรวจสอบค่าว่าง รายคอลัม')
print(df.isna().sum())

df = df.dropna(subset=['MSISDN'])

df['RC_RATE'] = df['RC_RATE'].fillna(0)

df['CUST_NAME'] = df['CUST_NAME'].fillna('Unknown Customer')

df['CONTRACT_END_DT'] = pd.to_datetime(df['CONTRACT_END_DT'])

df['CONTRACT_END_DT'] = df['CONTRACT_END_DT'].fillna(pd.Timestamp('2099-12-31'))

display(df)

       MSISDN CUST_NAME  RC_RATE CONTRACT_END_DT
0  0960000001    A Corp    599.0      2025-12-31
1         NaN     B Co.    899.0      2026-05-20
2  0960000003    C Shop      NaN      2026-12-31
3  0960000004       NaN    449.0             NaN
4  0960000005    E Ltd.   1200.0      2027-01-01

ตรวจสอบค่าว่าง รายคอลัม
MSISDN             1
CUST_NAME          1
RC_RATE            1
CONTRACT_END_DT    1
dtype: int64

       MSISDN         CUST_NAME  RC_RATE CONTRACT_END_DT
0  0960000001            A Corp    599.0      2025-12-31
2  0960000003            C Shop      0.0      2026-12-31
3  0960000004  Unknown Customer    449.0      2099-12-31
4  0960000005            E Ltd.   1200.0      2027-01-01

In [20]:
df = pd.read_excel('../Lesson_2/isp_duplicate_data.xlsx', dtype={'MSISDN': str})

df['UPDATE_DATE'] = pd.to_datetime(df['UPDATE_DATE'])
display(df)
print('จำนวนแถวที่ซ้ำ')
print(df.duplicated(subset=['MSISDN']).sum())

df = df.sort_values('UPDATE_DATE', ascending=True)

df_clean = df.drop_duplicates(subset=['MSISDN'], keep='last')

print(f'จากเดิม {len(df)} แถว เหลือข้อมูลที่ถูกต้อง {len(df_clean)}')
display(df_clean)

       MSISDN     CUST_NAME UPDATE_DATE  RC_RATE
0  0960000001        A Corp  2026-01-01      599
1  0960000001  A Corp (New)  2026-02-15      699
2  0960000002         B Co.  2026-02-10      899
3  0960000003        C Shop  2026-01-20     1200
4  0960000003        C Shop  2026-01-20     1200

จำนวนแถวที่ซ้ำ
2
จากเดิม 5 แถว เหลือข้อมูลที่ถูกต้อง 3

       MSISDN     CUST_NAME UPDATE_DATE  RC_RATE
4  0960000003        C Shop  2026-01-20     1200
2  0960000002         B Co.  2026-02-10      899
1  0960000001  A Corp (New)  2026-02-15      699